zsh-utilities-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zsh Utilities Emacs</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="stylesheets/styles.css">
                <link rel="stylesheet" href="stylesheets/org-pygments.css">
</head>
<body>
<div id="content">
<h1 class="title">Zsh Utilities Emacs</h1>
<p>
This is part of the <a href="zsh-utilities.html">Zsh Utilities</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Zsh Utilities - Emacs</h2>
<div class="outline-text-2" id="text-1">
<p>
This file provides some functions to handle <code>emacs</code> and its daemon.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">relaunch_emacs_daemon</span> ()
{
    __pkgtools__at_function_enter relaunch_emacs_daemon
    <span class="org-builtin">local</span> <span class="org-variable-name">pid</span>=$(ps -edf | grep ${<span class="org-variable-name">USER</span>} | grep emacs | grep daemon | awk <span class="org-string">'{print $2}'</span>)
    <span class="org-keyword">if</span> [[ <span class="org-string">"${pid}"</span> != <span class="org-string">""</span> ]]; <span class="org-keyword">then</span>
        <span class="org-builtin">kill</span> -9 ${<span class="org-variable-name">pid</span>}
    <span class="org-keyword">fi</span>

    \emacs --daemon &gt; /dev/null 2&gt;&amp;1 &amp;&amp; notify -t 1000 -u low -i emacs <span class="org-string">"Emacs"</span> <span class="org-string">"Restart daemon done"</span>
    <span class="org-keyword">if</span> [[ <span class="org-string">"$1"</span> != <span class="org-string">""</span> ]]; <span class="org-keyword">then</span>
        emacs -e <span class="org-string">"(sk-desktop)"</span> $<span class="org-variable-name">1</span>
    <span class="org-keyword">else</span>
        emacs -e <span class="org-string">"(sk-desktop)"</span>
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under git version control - commit e8b7f82 - 2013-10-30
</div>
</body>
</html>
